Австралия/src/Catalogs/PerformerRoles/PerformerRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PerformerRoles</name>
  <predefined>
    <items>
      <name>EmployeeApprovingPurchases</name>
      <description>Purchase order approver</description>
    </items>
    <items>
      <name>Salespersons</name>
      <description>Salespersons</description>
    </items>
    <items>
      <name>EmployeeResponsibleForTasksManagement</name>
      <description>Task control manager</description>
    </items>
  </predefined>
  <attributes>
    <name>UsedWithoutAddressingObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BriefPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UsedByAddressingObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObjectTypes</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObjectTypes</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalRole</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeNode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.User</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/TaskPerformers/TaskPerformers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TaskPerformers</name>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <dimensions>
    <name>PerformerRole</name>
    <type>
      <types>CatalogRef.PerformerRoles</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Internal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserProperies</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/PerformerRoles/Forms/ListForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetConditionalAppearance();
	
	ConfigureRoleListRepresentation();
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject);
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "Write_ConstantsSet" AND Source = "UseExternalUsers" Then
		ConfigureRoleListRepresentation();
	EndIf;
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ConfigureRoleListRepresentation()
	
	If GetFunctionalOption("UseExternalUsers") Then
		
		QueryText = "SELECT
		|	CatalogPerformersRoles.Ref,
		|	CatalogPerformersRoles.DeletionMark,
		|	CatalogPerformersRoles.Predefined,
		|	CatalogPerformersRoles.Code,
		|	CatalogPerformersRoles.Description,
		|	CatalogPerformersRoles.UsedWithoutAddressingObjects,
		|	CatalogPerformersRoles.UsedByAddressingObjects,
		|	CatalogPerformersRoles.MainAddressingObjectTypes,
		|	CatalogPerformersRoles.AdditionalAddressingObjectTypes,
		|	CatalogPerformersRoles.Comment,
		|	CASE
		|		WHEN CatalogPerformersRoles.UsedByAddressingObjects
		|			THEN TRUE
		|		WHEN CatalogPerformersRoles.Ref IN
		|				(SELECT TOP 1
		|					InformationRegister.TaskPerformers.PerformerRole.Ref
		|				FROM
		|					InformationRegister.TaskPerformers
		|				WHERE
		|					InformationRegister.TaskPerformers.PerformerRole = CatalogPerformersRoles.Ref)
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS HasPerformers,
		|	CatalogPerformersRoles.ExternalRole,
		|	CatalogPerformersRoles.BriefPresentation
		|FROM
		|	Catalog.PerformerRoles AS CatalogPerformersRoles";
		
	Else
		
		QueryText = "SELECT
		|	CatalogPerformersRoles.Ref,
		|	CatalogPerformersRoles.DeletionMark,
		|	CatalogPerformersRoles.Predefined,
		|	CatalogPerformersRoles.Code,
		|	CatalogPerformersRoles.Description,
		|	CatalogPerformersRoles.UsedWithoutAddressingObjects,
		|	CatalogPerformersRoles.UsedByAddressingObjects,
		|	CatalogPerformersRoles.MainAddressingObjectTypes,
		|	CatalogPerformersRoles.AdditionalAddressingObjectTypes,
		|	CatalogPerformersRoles.Comment,
		|	CASE
		|		WHEN CatalogPerformersRoles.UsedByAddressingObjects
		|			THEN TRUE
		|		WHEN CatalogPerformersRoles.Ref IN
		|				(SELECT TOP 1
		|					InformationRegister.TaskPerformers.PerformerRole.Ref
		|				FROM
		|					InformationRegister.TaskPerformers
		|				WHERE
		|					InformationRegister.TaskPerformers.PerformerRole = CatalogPerformersRoles.Ref)
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS HasPerformers,
		|	CatalogPerformersRoles.ExternalRole,
		|	CatalogPerformersRoles.BriefPresentation
		|FROM
		|	Catalog.PerformerRoles.Purpose AS AssigneeRolesAssignment
		|		LEFT JOIN Catalog.PerformerRoles AS CatalogPerformersRoles
		|		ON AssigneeRolesAssignment.Ref = CatalogPerformersRoles.Ref
		|WHERE
		|	AssigneeRolesAssignment.UsersType = VALUE(Catalog.Users.EmptyRef)";
	EndIf;
	
	ListProperties = Common.DynamicListPropertiesStructure();
	ListProperties.MainTable              = "Catalog.PerformerRoles";
	ListProperties.DynamicDataRead = True;
	ListProperties.QueryText                 = QueryText;
	Common.SetDynamicListProperties(Items.List, ListProperties);
	
EndProcedure

&AtServer
Procedure SetConditionalAppearance()
	
	List.ConditionalAppearance.Items.Clear();
	Item = List.ConditionalAppearance.Items.Add();
	
	FilterItemsGroup = Item.Filter.Items.Add(Type("DataCompositionFilterItemGroup"));
	FilterItemsGroup .GroupType = DataCompositionFilterItemsGroupType.AndGroup;
	
	ItemFilter = FilterItemsGroup.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("HasPerformers");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	ItemFilter = FilterItemsGroup.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("ExternalRole");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	Item.Appearance.SetParameterValue("TextColor", StyleColors.RoleWithoutPerformers);
	
EndProcedure

#EndRegion
